app/Repositories/Rkpd/RenjaRepository.php

select * from `data_sub_keg_bl` where `tahun_anggaran` = 2025 and `active` = 1
---
    public function getAll()
    {
        return DB::table('data_sub_keg_bl')
            ->where('tahun_anggaran', self::TAHUN_ANGGARAN_DEFAULT)
            ->where('active', 1)
            ->get();

select * from `sumber_dana`
---
    public function getSumberDana()
    {
        return DB::table('sumber_dana')->get();

select count(*) as aggregate from `data_sub_keg_indikator` where `kode_sbl` = '2944.2944.1186.8709.20294' and `active` = 1
---
    public function countIndikator(string $kodeSbl): int
    {
        return DB::table('data_sub_keg_indikator')
            ->where('kode_sbl', $kodeSbl)
            ->where('active', 1)
            ->count();

select * from `data_unit` where `tahun_anggaran` = 2025 order by `nama_skpd` asc
---
    public function getDataUnit(int $tahunAnggaran)
    {
        return DB::table('data_unit')
            ->where('tahun_anggaran', $tahunAnggaran)
            ->orderBy('nama_skpd')
            ->get();

select * from `data_unit` where `id_skpd` = 3050 and `tahun_anggaran` = 2025 limit 1
---
    public function getDataUnitById(int $idSkpd, int $tahunAnggaran)
    {
        return DB::table('data_unit')
            ->where('id_skpd', $idSkpd)
            ->where('tahun_anggaran', $tahunAnggaran)
            ->first();

select * from `data_daerah`
---
    public function getDataDaerah()
    {
        return DB::table('data_daerah')->get();

select * from `data_kecamatan`
---
    public function getDataKecamatan()
    {
        return DB::table('data_kecamatan')->get();

select * from `data_kelurahan`
---
    public function getDataKelurahan()
    {
        return DB::table('data_kelurahan')->get();

select * from `data_bulan`
---
    public function getDataBulan()
    {
        return DB::table('data_bulan')->get();

select * from `data_sub_keg_bl` where `id_skpd` = 3050 and `tahun_anggaran` = 2025 and `active` = 1 order by `kode_urusan` asc, `kode_bidang_urusan` asc, `kode_program` asc, `kode_giat` asc, `kode_sub_giat` asc
---
    public function getRenjaRowsForExport(int $idSkpd, int $tahunAnggaran): Collection
    {
        return DB::table('data_sub_keg_bl')
            ->where('id_skpd', $idSkpd)
            ->where('tahun_anggaran', $tahunAnggaran)
            ->where('active', 1)
            ->orderBy('kode_urusan')
            ->orderBy('kode_bidang_urusan')
            ->orderBy('kode_program')
            ->orderBy('kode_giat')
            ->orderBy('kode_sub_giat')
            ->get();

select * from `data_dana_sub_keg` where `idsubbl` in (1190, 1191, 1192, 1198, 1193, 1199, 1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1194, 1195, 1188, 1196, 1197, 1189, 1187) and `active` = 1
---
    public function getSumberDanaByIds(array $idSubBlList): Collection
    {
        if (empty($idSubBlList)) {
            return collect();
        }

        return DB::table('data_dana_sub_keg')
            ->whereIn('idsubbl', $idSubBlList)
            ->where('active', 1)
            ->get()
            ->groupBy('idsubbl');

select * from `data_sub_keg_indikator` where `idsubbl` in (1190, 1191, 1192, 1198, 1193, 1199, 1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1194, 1195, 1188, 1196, 1197, 1189, 1187) and `active` = 1
---
    public function getIndikatorByIds(array $idSubBlList): Collection
    {
        if (empty($idSubBlList)) {
            return collect();
        }

        return DB::table('data_sub_keg_indikator')
            ->whereIn('idsubbl', $idSubBlList)
            ->where('active', 1)
            ->get()
            ->groupBy('idsubbl');

select count(*) as aggregate from `data_sub_keg_bl` where `tahun_anggaran` = 2025 and `active` = 1
---
    public function getTotalRecords(): int
    {
        return DB::table('data_sub_keg_bl')
            ->where('tahun_anggaran', self::TAHUN_ANGGARAN_DEFAULT)
            ->where('active', 1)
            ->count();