app/Http/Controllers/Rkpd/RincianBelanjaController.php

select `dskb`.*, `du`.`nama_skpd` as `nama_unit` from `data_sub_keg_bl` as `dskb` left join `data_unit` as `du` on `dskb`.`id_skpd` = `du`.`id_skpd` and `du`.`tahun_anggaran` = 2025 where `dskb`.`id_sub_bl` = '15693' and `dskb`.`tahun_anggaran` = 2025 and `dskb`.`active` = 1 limit 1
---
    public function index($id)
    {
        try {
            Log::info('=== SHOW RINCIAN START ===', ['id_sub_bl' => $id]);

            // ===============================
            // 1. AMBIL DATA SUB KEGIATAN
            // ===============================
            $subKegiatan = DB::table('data_sub_keg_bl as dskb')
                ->select('dskb.*', 'du.nama_skpd as nama_unit')
                ->leftJoin('data_unit as du', function ($join) {
                    $join->on('dskb.id_skpd', '=', 'du.id_skpd')
                        ->where('du.tahun_anggaran', 2025);
                })
                ->where('dskb.id_sub_bl', $id)
                ->where('dskb.tahun_anggaran', 2025)
                ->where('dskb.active', 1)
                ->first();

select * from `data_dana_sub_keg` where `idsubbl` = 15693 and `tahun_anggaran` = 2025 and `active` = 1
select * from `data_dana_sub_keg` where `kode_sbl` = '2944.2944.1186.8709.20294' and `tahun_anggaran` = 2025 and `active` = 1
---

            // ===============================
            // 2. AMBIL SUMBER DANA
            // ===============================
            $sumberDana = DB::table('data_dana_sub_keg')
                ->where('idsubbl', $subKegiatan->id_sub_bl)
                ->where('tahun_anggaran', 2025)
                ->where('active', 1)
                ->get();

            if ($sumberDana->isEmpty()) {
                $sumberDana = DB::table('data_dana_sub_keg')
                    ->where('kode_sbl', $subKegiatan->kode_sbl)
                    ->where('tahun_anggaran', 2025)
                    ->where('active', 1)
                    ->get();

select * from `data_sub_keg_indikator` where `idsubbl` = 15693 and `tahun_anggaran` = 2025 and `active` = 1
select * from `data_sub_keg_indikator` where `kode_sbl` = '2944.2944.1186.8709.20294' and `tahun_anggaran` = 2025 and `active` = 1
---

            // ===============================
            // 3. AMBIL INDIKATOR
            // ===============================
            $indikator = DB::table('data_sub_keg_indikator')
                ->where('idsubbl', $subKegiatan->id_sub_bl)
                ->where('tahun_anggaran', 2025)
                ->where('active', 1)
                ->get();

            if ($indikator->isEmpty()) {
                $indikator = DB::table('data_sub_keg_indikator')
                    ->where('kode_sbl', $subKegiatan->kode_sbl)
                    ->where('tahun_anggaran', 2025)
                    ->where('active', 1)
                    ->get();

select * from `data_rka` where `idsubbl` = 15693 and `tahun_anggaran` = 2025 and `active` = 1 and (`ket_bl_teks` is null or `ket_bl_teks` != '--- PAKET/KELOMPOK ---') order by `idsubtitle` asc, `ket_bl_teks` asc, `kode_akun` asc, `id` asc
---

            // ===============================
            // 4. AMBIL SEMUA DATA RKA
            // ===============================
            $allRka = DB::table('data_rka')
                ->where('idsubbl', $subKegiatan->id_sub_bl)
                ->where('tahun_anggaran', 2025)
                ->where('active', 1)
                ->where(function ($q) {
                    $q->whereNull('ket_bl_teks')
                        ->orWhere('ket_bl_teks', '!=', '--- PAKET/KELOMPOK ---');
                })
                ->orderBy('idsubtitle')
                ->orderBy('ket_bl_teks')
                ->orderBy('kode_akun')
                ->orderBy('id')
                ->get();